---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StartExtension
source: html/48c63a60-890e-74c5-20b8-3b4484ac3291.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StartExtension Property

"Start Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId StartExtension { get; }
```